programmingTutorial09-10/programmingTutorial09-10/testCase/001-cavitatingTransportFoam/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
       type            zeroGradient;
        value           uniform 2.2e5;
    }

    outlet
     {
        
       // type            fixedValue;
       // value           $internalField;      

       type            totalPressure; 
        p0              uniform 1e5;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 1e5;
    }


    wall
    {
         type          zeroGradient;//  fixedFluxPressure;
    }

 }

// ************************************************************************* //
