programmingTutorial09-10/programmingTutorial09-10/testCase/001-cavitatingTransportFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       56800;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       57200;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5900;
        startFace       57300;
    }
)

// ************************************************************************* //
