programmingTutorial09-10/programmingTutorial09-10/testCase/001-cavitatingTransportFoam/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water vapour);

phaseChangeTwoPhaseMixture Kunz;

pSat             pSat       [1 -1 -2 0 0]    2300;   // saturation pressure

sigma           sigma [1 0 -2 0 0 0 0] 0.0;	// surface tension

water				// liquid properties
{
    transportModel Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 9e-07;   // kinematic viscosity
    rho             rho [1 -3 0 0 0 0 0] 1000;
}

vapour				// vapor properties
{
    transportModel Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 4.273e-04;
    rho             rho [1 -3 0 0 0 0 0] 0.02308;
}

KunzCoeffs
{
    UInf            UInf   [0 1 -1 0 0 0 0]     3.2;
    tInf            tInf   [0 0 1 0 0 0 0]      0.005; // L = 0.1 m
    Cc              Cc     [0 0 0 0 0 0 0]      1000;
    Cv              Cv     [0 0 0 0 0 0 0]      1000;
}

MerkleCoeffs
{
    UInf            UInf   [0 1 -1 0 0 0 0]     4.25;
    tInf            tInf   [0 0 1 0 0 0 0]      0.005;  // L = 0.1 m
    Cc              Cc     [0 0 0 0 0 0 0]      90;
    Cv              Cv     [0 0 0 0 0 0 0]      1e-03;
}

SchnerrSauerCoeffs
{
    n               n      [0 -3 0 0 0 0 0]     1.0e+8;
    dNuc            dNuc   [0 1 0 0 0 0 0]      2e-06;
    Cc              Cc     [0 0 0 0 0 0 0]      1.0;
    Cv              Cv     [0 0 0 0 0 0 0]      1.0;
}


// ************************************************************************* //
